"""
Лабораторна робота №2
"Нейронні мережі"
виконала студентка групи АнД-31
Трофимчук Ольга

Завдання:

Поглиблено вивчити функцію make_regression.

Функція make_regression в бібліотеці sklearn створює зразки даних для задачі регресії. Основні параметри функції:
1. n_samples (ціле число): кількість зразків, що мають бути створені (за замовчуванням 100).
2. n_features (ціле число): кількість ознак у кожному зразку (за замовчуванням 100).
3. n_targets (ціле число): кількість цільових змінних (за замовчуванням 1).
4. noise (дійсне число або None): рівень шуму в даних (за замовчуванням 0.0).
5. bias (дійсне число або None): додатковий термін у лінійній моделі, який додається до відповідей
(за замовчуванням 0.0).
6. coef (булеве значення або None): вказує, чи потрібно повернути коефіцієнти регресії (за замовчуванням False).
7. random_state (ціле число або об'єкт RandomState): забезпечує відтворюваність результатів (за замовчуванням None).

Згенерувати набір даних за допомогою означеної функції, з використанням якнайбільшої кількості параметрів.
Розмірність набору даних прийняти у вигляді (100000х(30-n)), де n - номер за списком (варіант 8).
"""
from sklearn.datasets import make_regression
import pandas as pd

# Генерація набору даних за варіантом
n = 8
X, y = make_regression(n_samples=100000*(30-n), n_features=30-n, noise=0.1)

# Збереження набору даних у файл
df = pd.DataFrame(data=X, columns=[f'feature_{i + 1}' for i in range(X.shape[1])])
df['target'] = y
df.to_csv('regression_data.csv', index=False)
